echo "Hello, I'm check-manifestes.sh"
cd /home






#if (( ${#a[@]} )); then
#    echo not empty
#fi


# Поиск манифестов:

### Найти все файлы манифестов для записи в новый массив всех его ключей-значений
### ... Здесь будет проверка синтаксиса файла манифеста
### Перед записью каждого нового манифеста в массив, проверить, нет ли уже в массиве манифеста с таким же путём. Если есть - вернуть ошибку и завершить скрипт.
### Если всё ок, вернуть "Манифесты обработаны" и продолжить основной скрипт

