// В зависимости от наличия ключа --force переходим на выполнение или gen-stanrart или gen-force (выполняется с помощью process.argv)


// Описываем поток standart


// Описываем поток force



// TODO:
// Подключаем functions.sh
// Запустить check-libs.sh
// Запустить find-manifestes.sh
// Запустить output.sh

// Если ошибка на любой из итераций - остановить вывести полной лог
// Если успешно завершилось всё - вывести полной лог успешных завершений скриптов.

// BACKLIST
// Запустить check-manifestes.sh

